app/views/people/_form.html.erb

        <label class="select">
        <%=  collection_select(:person, :organization_id, Organization.all.sort_by( ),
          :id, :name,
          {:prompt => 'Organization'})
---
SELECT "organizations".* FROM "organizations"