app/views/people/_newcontact.html.erb

          <datalist id="organizations_autocomplete">
            <% Organization.all.each do |organization| %>
---
SELECT "organizations".* FROM "organizations"