app/views/customer_jobs/_form.html.erb

SELECT "organizations".* FROM "organizations"
---
      <%= form.label 'Select Customer' %>
      <%= collection_select(:customer_job, :organization_id, Organization.all,
                        :id, :name,
                        {:prompt => 'Select Customer'})