app/controllers/action_results_controller.rb

  def index
    @action_results = ActionResult.all
---
SELECT "action_results".* FROM "action_results"