app/controllers/customer_jobs_controller.rb

SELECT "customer_jobs".* FROM "customer_jobs" ORDER BY job_name ASC
---
  def index
   # @customer_jobs = CustomerJob.where(depth: 0).order('job_name ASC')
   @customer_jobs = CustomerJob.all.order('job_name ASC')

INSERT INTO "customer_jobs" ("job_name", "organization_id") VALUES (?, ?)  [["job_name", "dfgs"], ["organization_id", 1]]
---
  def create

    @customer_job = CustomerJob.new( customer_job_params )

    respond_to do |format|
      if @customer_job.save

SELECT  "customer_jobs".* FROM "customer_jobs" WHERE "customer_jobs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_customer_job
      @customer_job = CustomerJob.find(params[:id])

SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def load_organization
      @organization = Organization.find( params[:organization_id] )