app/controllers/organizations_controller.rb

  def index
    @organizations = Organization.all
---
SELECT "organizations".* FROM "organizations"

  def show
    @people = @organization.people.all
---
SELECT "people".* FROM "people" WHERE "people"."organization_id" = ?  [["organization_id", 1]]

  def create
    @organization = Organization.create( organization_params )
---
INSERT INTO "organizations" ("name", "address1", "address2", "city", "state", "country", "longitude", "latitude", "city_and_state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @organization.update(organization_params)
---
UPDATE "organizations" SET "address1" = ?, "city_and_state" = ?, "updated_at" = ? WHERE "organizations"."id" = ?  [["address1", "9511 182nd PL NE, Unit 102"], ["city_and_state", "Redmond"], ["updated_at", "2018-02-06 01:51:30.878306"], ["id", 1]]

    def set_organization
      @organization = Organization.find(params[:id])
---
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]