app/controllers/people_controller.rb

  def create
  #  @organization = Organization.find( organization_params[:id] )
    @resource = @parent.people.new( person_params )

    respond_to do |format|
    if @resource.save
---
INSERT INTO "people" ("organization_id", "first_name", "last_name", "email", "telephone", "job_title", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)