app/controllers/people_controller.rb

  def index
  #  @people = Person.all
    @people = @organization.people.all
---
SELECT "people".* FROM "people" WHERE "people"."organization_id" = ?  [["organization_id", 1]]

  def show
    @person = @organization.people.find( params[:id])
---
SELECT  "people".* FROM "people" WHERE "people"."organization_id" = ? AND "people"."id" = ? LIMIT ?  [["organization_id", 1], ["id", 1], ["LIMIT", 1]]

  def edit
    @person = @organization.people.find( params[:id])
---
SELECT  "people".* FROM "people" WHERE "people"."organization_id" = ? AND "people"."id" = ? LIMIT ?  [["organization_id", 1], ["id", 1], ["LIMIT", 1]]

  def load_organization
    @organization = Organization.find( params[:organization_id] )
---
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]