app/controllers/toe_tags_controller.rb

SELECT "toe_tags".* FROM "toe_tags"
---
  def index
    @toe_tags = ToeTag.all

INSERT INTO "toe_tags" ("priority", "big_small_now", "solution", "success_measurement", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @toe_tag = ToeTag.new(toe_tag_params)

    respond_to do |format|
      if @toe_tag.save

UPDATE "toe_tags" SET "solution" = ?, "updated_at" = ? WHERE "toe_tags"."id" = ?  [["solution", "rqwervqwe fgh dfgh dfg hdfghdfg"], ["updated_at", "2018-02-05 04:51:54.084327"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @toe_tag.update(toe_tag_params)

SELECT  "toe_tags".* FROM "toe_tags" WHERE "toe_tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_toe_tag
      @toe_tag = ToeTag.find(params[:id])