app/controllers/workshops_controller.rb

  def index
    @workshops = Workshop.all
---
SELECT "workshops".* FROM "workshops"